arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/driverlib/timer.h
//*****************************************************************************
//
//! \brief Gets the timer match value.
//!
//! This function gets the match value for the specified timer.
//!
//! \note This function can be used for both full- and half-width modes of
//! 16/32-bit timers.
//!
//! \note Only \ref TIMER_A should be used when the timer is configured for
//! full-width operation.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer; must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//! - \ref TIMER_BOTH
//!
//! \return Returns the match value for the timer
//
//*****************************************************************************
__STATIC_INLINE uint32_t
TimerMatchGet(uint32_t ui32Base, uint32_t ui32Timer)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == TIMER_A) || (ui32Timer == TIMER_B));

    //
    // Return the appropriate match value.
    //
    return((ui32Timer == TIMER_A) ? HWREG(ui32Base + GPT_O_TAMATCHR) :
           HWREG(ui32Base + GPT_O_TBMATCHR));
}

//*****************************************************************************
//
//! \brief Registers an interrupt handler for the timer interrupt.
//!
//! This function registers the handler to be called when a timer interrupt
//! occurs. In addition, this function enables the global interrupt in the
//! interrupt controller; specific timer interrupts must be enabled via
//! \ref TimerIntEnable(). It is the interrupt handler's responsibility to clear
//! the interrupt source via \ref TimerIntClear().
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s); must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//! - \ref TIMER_BOTH
//! \param pfnHandler is a pointer to the function to be called when the timer
//! interrupt occurs.
//!
//! \return None
//!
//! \sa \ref IntRegister() for important information about registering interrupt
//! handlers.
//
//*****************************************************************************
extern void TimerIntRegister(uint32_t ui32Base, uint32_t ui32Timer,
                             void (*pfnHandler)(void));

//*****************************************************************************
//
//! \brief Unregisters an interrupt handler for the timer interrupt.
//!
//! This function unregisters the handler to be called when a timer interrupt
//! occurs. This function also masks off the interrupt in the interrupt
//! controller so that the interrupt handler is no longer called.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s); must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//! - \ref TIMER_BOTH
//!
//! \return None
//!
//! \sa \ref IntRegister() for important information about registering interrupt
//! handlers.
//
//*****************************************************************************
extern void TimerIntUnregister(uint32_t ui32Base, uint32_t ui32Timer);

//*****************************************************************************
//
//! \brief Enables individual timer interrupt sources.
//!
//! This function enables the indicated timer interrupt sources. Only the
//! sources that are enabled can be reflected to the processor interrupt;
//! disabled sources have no effect on the processor.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32IntFlags is the bit mask of the interrupt sources to be enabled.
//! The parameter must be the bitwise OR of any combination of
//! the following:
//! - \ref TIMER_CAPB_EVENT    : Capture B event interrupt.
//! - \ref TIMER_CAPB_MATCH    : Capture B match interrupt.
//! - \ref TIMER_TIMB_TIMEOUT  : Timer B timeout interrupt.
//! - \ref TIMER_RTC_MATCH     : RTC interrupt mask.
//! - \ref TIMER_CAPA_EVENT    : Capture A event interrupt.
//! - \ref TIMER_CAPA_MATCH    : Capture A match interrupt.
//! - \ref TIMER_TIMA_TIMEOUT  : Timer A timeout interrupt.
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
TimerIntEnable(uint32_t ui32Base, uint32_t ui32IntFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));

    //
    // Enable the specified interrupts.
    //
    HWREG(ui32Base + GPT_O_IMR) |= ui32IntFlags;
}

//*****************************************************************************
//
//! \brief Disables individual timer interrupt sources.
//!
//! This function disables the indicated timer interrupt sources. Only the
//! sources that are enabled can be reflected to the processor interrupt;
//! disabled sources have no effect on the processor.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32IntFlags is the bit mask of the interrupt sources to be disabled.
//! The parameter must be the bitwise OR of any combination of
//! the following:
//! - \ref TIMER_CAPB_EVENT    : Capture B event interrupt.
//! - \ref TIMER_CAPB_MATCH    : Capture B match interrupt.
//! - \ref TIMER_TIMB_TIMEOUT  : Timer B timeout interrupt.
//! - \ref TIMER_RTC_MATCH     : RTC interrupt mask.
//! - \ref TIMER_CAPA_EVENT    : Capture A event interrupt.
//! - \ref TIMER_CAPA_MATCH    : Capture A match interrupt.
//! - \ref TIMER_TIMA_TIMEOUT  : Timer A timeout interrupt.
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
TimerIntDisable(uint32_t ui32Base, uint32_t ui32IntFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));

    //
    // Disable the specified interrupts.
    //
    HWREG(ui32Base + GPT_O_IMR) &= ~(ui32IntFlags);
}

//*****************************************************************************
//
//! \brief Gets the current interrupt status.
//!
//! This function returns the interrupt status for the timer module. Either
//! the raw interrupt status or the status of interrupts that are allowed to
//! reflect to the processor can be returned.
//!
//! \param ui32Base is the base address of the timer module.
//! \param bMasked selects either raw or masked interrupt status:
//! - \c true  : Masked interrupt.
//! - \c false : Raw interrupt.
//!
//! \return The current interrupt status, enumerated as a bit field of values:
//! - \ref TIMER_CAPB_EVENT    : Capture B event interrupt.
//! - \ref TIMER_CAPB_MATCH    : Capture B match interrupt.
//! - \ref TIMER_TIMB_TIMEOUT  : Timer B timeout interrupt.
//! - \ref TIMER_RTC_MATCH     : RTC interrupt mask.
//! - \ref TIMER_CAPA_EVENT    : Capture A event interrupt.
//! - \ref TIMER_CAPA_MATCH    : Capture A match interrupt.
//! - \ref TIMER_TIMA_TIMEOUT  : Timer A timeout interrupt.
//
//*****************************************************************************
__STATIC_INLINE uint32_t
TimerIntStatus(uint32_t ui32Base, bool bMasked)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));

    //
    // Return either the interrupt status or the raw interrupt status as
    // requested.
    //
    return(bMasked ? HWREG(ui32Base + GPT_O_MIS) :
           HWREG(ui32Base + GPT_O_RIS));
}

//*****************************************************************************
//
//! \brief Clears timer interrupt sources.
//!
//! The specified timer interrupt sources are cleared, so that they no longer
//! assert. This function must be called in the interrupt handler to keep the
//! interrupt from being triggered again immediately upon exit.
//!
//! \note Because there is a write buffer in the Cortex-M processor, it may
//! take several clock cycles before the interrupt source is actually cleared.
//! Therefore, it is recommended that the interrupt source be cleared early in
//! the interrupt handler (as opposed to the very last action) to avoid
//! returning from the interrupt handler before the interrupt source is
//! actually cleared. Failure to do so may result in the interrupt handler
//! being immediately reentered (because the interrupt controller still sees
//! the interrupt source asserted).
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32IntFlags is a bit mask of the interrupt sources to be cleared.
//! The parameter must be the bitwise OR of any combination of
//! the following:
//! - \ref TIMER_CAPB_EVENT    : Capture B event interrupt.
//! - \ref TIMER_CAPB_MATCH    : Capture B match interrupt.
//! - \ref TIMER_TIMB_TIMEOUT  : Timer B timeout interrupt.
//! - \ref TIMER_RTC_MATCH     : RTC interrupt mask.
//! - \ref TIMER_CAPA_EVENT    : Capture A event interrupt.
//! - \ref TIMER_CAPA_MATCH    : Capture A match interrupt.
//! - \ref TIMER_TIMA_TIMEOUT  : Timer A timeout interrupt.
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
TimerIntClear(uint32_t ui32Base, uint32_t ui32IntFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(TimerBaseValid(ui32Base));

    //
    // Clear the requested interrupt sources.
    //
    HWREG(ui32Base + GPT_O_ICLR) = ui32IntFlags;
}

//*****************************************************************************
//
//! \brief Synchronizes the counters in a set of timers.
//!
//! This function synchronizes the counters in a specified set of timers.
//! When a timer is running in half-width mode, each half can be included or
//! excluded in the synchronization event. When a timer is running in
//! full-width mode, only the A timer can be synchronized (specifying the B
//! timer has no effect).
//!
//! \param ui32Base is the base address of the timer module. This parameter must
//! be the base address of Timer0 (in other words, \b GPT0_BASE).
//! \param ui32Timers is the set of timers to synchronize.
//! The parameter is the bitwise OR of any of the following:
//! - \ref TIMER_0A_SYNC
//! - \ref TIMER_0B_SYNC
//! - \ref TIMER_1A_SYNC
//! - \ref TIMER_1B_SYNC
//! - \ref TIMER_2A_SYNC
//! - \ref TIMER_2B_SYNC
//! - \ref TIMER_3A_SYNC
//! - \ref TIMER_3B_SYNC
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
TimerSynchronize(uint32_t ui32Base, uint32_t ui32Timers)
{
    //
    // Check the arguments.
    //
    ASSERT(ui32Base == GPT0_BASE);

    //
    // Synchronize the specified timers.
    //
    HWREG(ui32Base + GPT_O_SYNC) = ui32Timers;
}

//*****************************************************************************
//
//! \brief Enables AND'ing of the CCP outputs from Timer A and Timer B.
//!
//! \param ui32Base is the base address of the timer module.
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
TimerCcpCombineEnable(uint32_t ui32Base)
{
    // Check the arguments
    ASSERT(TimerBaseValid(ui32Base));

