arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/driverlib/timer.h
    // Set the bit using bit banding
    HWREGBITW(ui32Base + GPT_O_ANDCCP, GPT_ANDCCP_CCP_AND_EN_BITN) = 1;
}

//*****************************************************************************
//
//! \brief Disables AND'ing of the CCP outputs from Timer A and Timer B.
//!
//! \param ui32Base is the base address of the timer module.
//!
//! \return None
//
//*****************************************************************************
__STATIC_INLINE void
TimerCcpCombineDisable(uint32_t ui32Base)
{
    // Check the arguments
    ASSERT(TimerBaseValid(ui32Base));

    // Clear the bit using bit banding
    HWREGBITW(ui32Base + GPT_O_ANDCCP, GPT_ANDCCP_CCP_AND_EN_BITN) = 0;
}

//*****************************************************************************
//
//! \brief Sets the Match Register Update mode.
//!
//! This function controls when the Match Register value and Prescale Register value
//! are applied after writing these registers while a timer is enabled.
//!
//! \note If the timer is disabled when setting the update mode the Match Register
//! and Prescale Register values are applied immediately when enabling the timer.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to configure; must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//! - \ref TIMER_BOTH
//! \param ui32Mode sets the mode:
//! - \ref TIMER_MATCHUPDATE_NEXTCYCLE : Apply Match Register and Prescale Register on next clock
//!        cycle after writing any of these registers.
//! - \ref TIMER_MATCHUPDATE_TIMEOUT   : Apply Match Register and Prescale Register on next timeout
//!        after writing any of these registers.
//!
//! \return None
//
//*****************************************************************************
extern void TimerMatchUpdateMode(uint32_t ui32Base, uint32_t ui32Timer, uint32_t ui32Mode);

//*****************************************************************************
//
//! \brief Sets the Interval Load mode.
//!
//! This function controls when the Timer Register and Prescale Snap-shot (if used)
//! are updated.
//!
//! Timer Register (TAR/TBR) is updated when Interval Load Register (TAILR/TBILR) is written
//! and the Prescale Snap-shot (TAPS/TBPS) is updated when Prescale Register (TAPR/TBPR) is
//! written depending on the mode of operation.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s) to configure; must be one of:
//! - \ref TIMER_A
//! - \ref TIMER_B
//! - \ref TIMER_BOTH
//! \param ui32Mode sets the mode:
//! - \ref TIMER_INTERVALLOAD_NEXTCYCLE : Update Timer Register and Prescale Snap-shot on next clock
//!        cycle after writing Interval Load Register or Prescale Register, respectively.
//! - \ref TIMER_INTERVALLOAD_TIMEOUT   : Update Timer Register and Prescale Snap-shot on next timeout
//!        after writing Interval Load Register or Prescale Register, respectively.
//!
//! \return None
//
//*****************************************************************************
extern void TimerIntervalLoadMode(uint32_t ui32Base, uint32_t ui32Timer, uint32_t ui32Mode);

//*****************************************************************************
//
// Support for DriverLib in ROM:
// Redirect to implementation in ROM when available.
//
//*****************************************************************************
#ifndef DRIVERLIB_NOROM
    #include <driverlib/rom.h>
    #ifdef ROM_TimerConfigure
        #undef  TimerConfigure
        #define TimerConfigure                  ROM_TimerConfigure
    #endif
    #ifdef ROM_TimerLevelControl
        #undef  TimerLevelControl
        #define TimerLevelControl               ROM_TimerLevelControl
    #endif
    #ifdef ROM_TimerTriggerControl
        #undef  TimerTriggerControl
        #define TimerTriggerControl             ROM_TimerTriggerControl
    #endif
    #ifdef ROM_TimerStallControl
        #undef  TimerStallControl
        #define TimerStallControl               ROM_TimerStallControl
    #endif
    #ifdef ROM_TimerWaitOnTriggerControl
        #undef  TimerWaitOnTriggerControl
        #define TimerWaitOnTriggerControl       ROM_TimerWaitOnTriggerControl
    #endif
    #ifdef ROM_TimerIntRegister
        #undef  TimerIntRegister
        #define TimerIntRegister                ROM_TimerIntRegister
    #endif
    #ifdef ROM_TimerIntUnregister
        #undef  TimerIntUnregister
        #define TimerIntUnregister              ROM_TimerIntUnregister
    #endif
    #ifdef ROM_TimerMatchUpdateMode
        #undef  TimerMatchUpdateMode
        #define TimerMatchUpdateMode            ROM_TimerMatchUpdateMode
    #endif
    #ifdef ROM_TimerIntervalLoadMode
        #undef  TimerIntervalLoadMode
        #define TimerIntervalLoadMode           ROM_TimerIntervalLoadMode
    #endif
#endif

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif // __GPT_H__

//*****************************************************************************
//
//! Close the Doxygen group.
//! @}
//
//*****************************************************************************
